Revit 2026 API

# MasonryCMUApplicationType Enumeration

---

The enumerated type representing the permitted values for the asset property "MasonryCMUApplication" from the "MasonryCMU" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum MasonryCMUApplicationType
```
```vb
Public Enumeration MasonryCMUApplicationType
```
```cpp
public enum class MasonryCMUApplicationType
```
```fsharp
type MasonryCMUApplicationType
```

| Member name | Value | Description |
| --- | --- | --- |
| Glossy | 0 |  |
| Matte | 1 |  |
| Unfinished | 2 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace